'''
Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.
Найдите количество и выведите его.
'''

# list_1 = [1, 2, 3, 4, 5]
# k = 3
#
# count = 0
# for el in list_1:
#     if el == k:
#         count += 1
# print(count)

'''
Требуется найти в массиве list_1 самый близкий по величине элемент к заданному числу k и вывести его.
'''

# list_1 = [1, 2, 3, 5, 8, 9]
# k = 6
# list_1.insert(0, k)
# print(k)
# print(list_1)
# end_i = len(list_1) - 1
# for i in range(0, len(list_1)):
#     for j in range(1, len(list_1)):
#         if list_1[j - 1] > list_1[j]:
#             temp = list_1[j]
#             list_1[j] = list_1[j - 1]
#             list_1[j - 1] = temp
#         else:
#             j += 1
# print(list_1)
# for ind in range(0, len(list_1)):
#     if k == list_1[ind]:
#         temp_i = ind
# if k == list_1[end_i]:
#     print(list_1[end_i - 1])
# else:
#     if list_1[temp_i + 1] - k > k - list_1[temp_i - 1]:
#         print(list_1[temp_i - 1])
#     else:
#         print(list_1[temp_i + 1])

'''
В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.

В случае с английским алфавитом очки распределяются так:

A, E, I, O, U, L, N, S, T, R – 1 очко;
D, G – 2 очка;
B, C, M, P – 3 очка;
F, H, V, W, Y – 4 очка;
K – 5 очков;
J, X – 8 очков;
Q, Z – 10 очков.

А русские буквы оцениваются так:

А, В, Е, И, Н, О, Р, С, Т – 1 очко;
Д, К, Л, М, П, У – 2 очка;
Б, Г, Ё, Ь, Я – 3 очка;
Й, Ы – 4 очка;
Ж, З, Х, Ц, Ч – 5 очков;
Ш, Э, Ю – 8 очков;
Ф, Щ, Ъ – 10 очков
'''

# k = 'ноутбук'
#
# dict_ = {'A': 1, 'E': 1, 'I': 1, 'O': 1, 'U' : 1, 'L': 1, 'N': 1, 'S' : 1, 'T': 1, 'R': 1,
#          'D': 2, 'G': 2, 'B': 3, 'C': 3, 'M': 3, 'P': 3, 'F': 4, 'H': 4, 'V': 4, 'W': 4, 'Y': 4,
#          'K': 5, 'J': 8, 'X': 8, 'Q': 10, 'Z': 10,
#          'А': 1, 'В': 1, 'Е': 1, 'И': 1, 'Н': 1, 'О': 1, 'Р': 1, 'С': 1, 'Т': 1,
#          'Д': 2, 'К': 2, 'Л': 2, 'М': 2, 'П': 2, 'У': 2,
#          'Б': 3, 'Г': 3, 'Ё': 3, 'Ь': 3, 'Я': 3, 'Й': 4, 'Ы': 4,
#          'Ж': 5, 'З': 5, 'Х': 5, 'Ц': 5, 'Ч': 5, 'Ш': 8, 'Э': 8, 'Ю': 8, 'Ф': 10, 'Щ': 10, 'Ъ': 10}
#
# summ = 0
# for i in k.upper():
#     summ += dict_[i]
# print(summ)
